{
  "navbar": {
    "Home": "Home",
    "About": "About",
    "Skills": "Skills",
    "Projects": "Projects",
    "Experience": "Experience",
    "Contact": "Contact"
  },

  "home": {
    "Hi, I'm Luiz:": "Hi! I'm Luiz:",
    "Front": "Web Developer",
    "UX": "UX/UI Designer",
    "Designer": "Graphic Designer",
    "Editor": "Video Editor",
    "catch_phrase": "My job is to bring ideas to life, creating authentic and memorable solutions.",
    "About me": "About me",
    "Get in touch": "Get in touch"
  },

  "skills": {
    "Skills": "Skills",

    "Development": "Development",
    "DevelopText": "I have developed several projects using technologies such as TypeScript and Node.js, but I always explore new options to elevate my work to higher levels. I have also worked on academic/personal projects involving embedded programming and image processing.",

    "UX/UI Design": "UX/UI Design",
    "UXDesignText": "I use Figma to design intuitive interfaces and plan Design Systems that represent the project's purpose. Additionally, I always prioritize user needs while aiming for a smooth and seamless experience",

    "Design": "Graphic Design",
    "DesignText": "My experience in graphic design revolves around creating memorable visual identities and marketing materials. Mastering the key tools of Adobe Creative Cloud, my dedication goes beyond aesthetics: it's about effectively conveying a message.",

    "Video Editing": "Video Editing",
    "VideoEditText": "As a video editor and motion designer, my work involves crafting narratives to turn concepts into captivating stories. In each project, I strive for both visual and emotional excellence."
  },

  "about": {
    "About me": "About me",
    "AboutText": "I'm Luiz, a Front-End Web developer and Computer Engineering student at the Federal Technological University of Paraná. Passionate about design and technology, I invest a substantial amount of time to delve deeper and broaden my knowledge in these fields. I discovered my creative side early on when I began freelancing in graphic design, editing, and motion. Since then, I've been on a continuous journey of improvement, striving to become a more versatile professional.",

    "Tools and Technologies": "Tools and Technologies",
    "ToolsText": "I enjoy exploring new tools and I'm always seeking to specialize in something new. Below, you can check out some of the technologies I have already used in personal and professional projects.",
    "img_hover": "Yep, That's me!"
  },

  "projects": {
    "Projects": "Projects",
    "ProjectsText": "Check out some past projects I've worked on."
  },

  "experience": {
    "Experience": "Experience",
    "ExperienceText": "Scroll to see past experiences."
  },

  "contact": {
    "Contact": "Send me a message!",
    "ContactText": "Have a question, proposal, or just want to say hello? Feel free to reach out!",

    "NameLabel": "Your Name",
    "NamePlaceholder": "Enter your name",

    "EmailLabel": "Email Address",
    "EmailPlaceholder": "Enter your Email Address",

    "MessageLabel": "Your Message",
    "MessagePlaceholder": "Your profile caught my attention and I'm interested in discussing a potential collaboration opportunity. Are you available for a brief chat?",

    "error-message": "This field is required.",
    "error-message-email": "Enter a valid email address.",
    "submit": "Submit",
    "send-success-message": "Your message has been sent.",
    "send-error-message": "Something went wrong. Please try again."
  },

  "footer": {
    "social-media": "SOCIAL MEDIA",
    "sections": "SECTIONS",
    "contact-info": "CONTACT INFO",
    "lang": "LANGUAGE",
    "Home": "HOME",
    "About": "ABOUT",
    "Skills": "SKILLS",
    "Projects": "PROJECTS",
    "Experience": "EXPERIENCE",
    "Contact": "CONTACT"
  }
}
