{
  "navbar": {
    "Home": "Home",
    "About": "About",
    "Skills": "Skills",
    "Projects": "Projects",
    "Experience": "Experience",
    "Contact": "Contact"
  },

  "home": {
    "Hi, I'm Luiz:": "Hi! I'm Luiz:",
    "Front": "Front-End Developer",
    "UX": "UX/UI Designer",
    "Designer": "Graphic Designer",
    "Editor": "Video Editor",
    "catch_phrase": "My job is to bring ideas to life, creating authentic and memorable solutions.",
    "About me": "About me",
    "Get in touch": "Get in touch"
  },

  "skills": {
    "Skills": "Skills",

    "Development": "Development",
    "DevelopText": "I've developed projects using various tech stacks: From web fundamentals (HTML, CSS, and JavaScript) to CMS platforms like WordPress and HubSpot, and modern technologies such as React, TypeScript, and Next.js. Additionally, I've worked on academic projects involving embedded programming in C/C++ and machine learning with Python and TensorFlow.",

    "UX/UI Design": "UX/UI Design",
    "UXDesignText": "With a focus always on user needs, I believe good design is not only visually striking but also delivers results. Using Figma, I create interfaces and user flows that prioritize usability and experience.",

    "Design": "Graphic Design",
    "DesignText": "Having mastered the primary tools of the Adobe Creative Cloud, I've been responsible for creating social media artwork and graphic materials for various companies.",

    "Video Editing": "Video Editing",
    "VideoEditText": "As an video editor, I've worked on crafting narratives to transform concepts into engaging stories, while also worked on motion design projects to create animations and promotional videos."
  },

  "about": {
    "About me": "About me",
    "AboutText": "I'm Luiz, nice to meet you! I work as a Front-End Developer, and during my career, I've developed projects of diverse scopes: From building SEO-optimized websites focused on performance to maintaining complex web systems in high-availability environments. My strong creative streak, honed through prior roles as a designer and video editor, has sharpened my critical eye for usability and UX/UI best practices in applications. I'm passionate about programming and continually seek to expand my knowledge, having explored mobile development, game creation, and machine learning with a focus on computer vision. Below are some technologies I've used in previous projects:",

    "Tools and Technologies": "Tools and Technologies",
    "img_hover": "Yep, That's me!"
  },

  "projects": {
    "Projects": "Projects",
    "ProjectsText": "Check out some past projects I've worked on.",
    "SeeProject": "See project"
  },

  "experience": {
    "Experience": "Experience"
  },

  "contact": {
    "Contact": "Send me a message!",
    "ContactText": "Have a question, proposal, or just want to say hello? Feel free to reach out!",

    "NameLabel": "Your Name",
    "NamePlaceholder": "Enter your name",

    "EmailLabel": "Email Address",
    "EmailPlaceholder": "Enter your Email Address",

    "MessageLabel": "Your Message",
    "MessagePlaceholder": "Your profile caught my attention and I'm interested in discussing a potential collaboration opportunity. Are you available for a brief chat?",

    "error-message": "This field is required.",
    "error-message-email": "Enter a valid email address.",
    "submit": "Submit",
    "send-success-message": "Your message has been sent.",
    "send-error-message": "Something went wrong. Please try again."
  },

  "footer": {
    "social-media": "SOCIAL MEDIA",
    "sections": "SECTIONS",
    "contact-info": "CONTACT INFO",
    "lang": "LANGUAGE",
    "Home": "HOME",
    "About": "ABOUT",
    "Skills": "SKILLS",
    "Projects": "PROJECTS",
    "Experience": "EXPERIENCE",
    "Contact": "CONTACT"
  }
}
