{
  "navbar": {
    "Home": "Início",
    "About": "Sobre",
    "Skills": "Habilidades",
    "Projects": "Projetos",
    "Experience": "Experiência",
    "Contact": "Contato"
  },

  "home": {
    "Hi, I'm Luiz:": "Oi! Eu sou o Luiz:",
    "Front": "Desenvolvedor",
    "UX": "UX/UI Designer",
    "Designer": "Designer Gráfico",
    "Editor": "Editor de Vídeos",
    "catch_phrase": "Meu trabalho é dar vida à ideias, criando soluções autênticas e memoráveis.",
    "About me": "Sobre mim",
    "Get in touch": "Entre em contato"
  },

  "skills": {
    "Skills": "Habilidades",

    "Development": "Desenvolvimento",
    "DevelopText": "Já desenvolvi projetos utilizando diferentes tech stacks: Desde a base da web (HTML, CSS e Javascript), passando pelo uso de CMS's como WordPress e HubSpot, até o uso tecnologias modernas como React, Typescript e Next.js. Também já desenvolvi projetos acadêmicos de programação embarcada em C/C++ e de Machine Learning com Python e TensorFlow.",

    "UX/UI Design": "UX/UI Design",
    "UXDesignText": "Com foco sempre nas necessidades do usuário, acredito que um bom design é aquele que não apenas surpreende visualmente, mas que também traz resultados. Com uso do Figma, crio interfaces e fluxos de uso que priorizam a usabilidade e a experiência.",

    "Design": "Design Gráfico",
    "DesignText": "Dominando as principais ferramentas da Adobe Creative Cloud, já fui responsável pela criação de artes para mídias sociais e materiais gráficos para diversas empresas.",

    "Video Editing": "Edição de Vídeo",
    "VideoEditText": "Como editor, atuei com a criação de narrativas para transformar conceitos em histórias que prendem, além de trabalhar em projetos com Motion Design para criação de animações e vídeos promocionais."
  },

  "about": {
    "About me": "Quem sou eu?",
    "AboutText": "Sou o Luiz, Prazer! Atuo como Desenvolvedor Front-End e durante minha experiência trabalhei em projetos de diferentes escopos, desde o desenvolvimento de websites com enfoque em SEO e performance até a manutenção de sistemas web complexos em ambientes de alta disponibilidade. Tenho uma veia criativa bem forte, que se evidenciou em minhas experiências prévias como designer e editor de vídeos. Como consequência, desenvolvi um olhar é crítico quando o assunto é usabilidade ou boas práticas de UX/UI em aplicações. Sou fascinado pelo universo da programação e sempre busco expandir minha bolha de conhecimentos, já tendo explorado desenvolvimento mobile, criação de jogos e machine learning com enfoque em visão computacional. Confira algumas das tecnologias que já utilizei em projetos anteriores:",
    "Tools and Technologies": "Ferramentas e Tecnologias",
    "img_hover": "Esse sou eu!"
  },

  "projects": {
    "Projects": "Projetos",
    "ProjectsText": "Confira alguns projetos aos quais já contribuí:",
    "SeeProject": "Veja o projeto"
  },

  "experience": {
    "Experience": "Experiência"
  },

  "contact": {
    "Contact": "Me envie uma mensagem!",
    "ContactText": "Possui uma dúvida, proposta ou só quer deixar um comentário? Fique livre para entrar em contato!",

    "NameLabel": "Seu Nome",
    "NamePlaceholder": "Insira seu nome",

    "EmailLabel": "Endereço de Email",
    "EmailPlaceholder": "Insira seu endereço de email",

    "MessageLabel": "Sua Mensagem",
    "MessagePlaceholder": "O seu perfil me chamou a atenção e estou interessado em discutir uma possível oportunidade de colaboração. Você está disponível para uma breve conversa?",
    "error-message": "Este campo é necessário.",
    "error-message-email": "Insira um endereço de email válido.",
    "submit": "Enviar",
    "send-success-message": "Sua mensagem foi enviada.",
    "send-error-message": "Algo deu errado. Tente novamente."
  },

  "footer": {
    "social-media": "REDES SOCIAIS",
    "sections": "SEÇÕES",
    "contact-info": "CONTATO",
    "lang": "IDIOMA",
    "Home": "HOME",
    "About": "SOBRE",
    "Skills": "HABILIDADES",
    "Projects": "PROJETOS",
    "Experience": "EXPERIÊNCIA",
    "Contact": "CONTATO"
  }
}
