{
  "navbar": {
    "Home": "Início",
    "About": "Sobre",
    "Skills": "Habilidades",
    "Projects": "Projetos",
    "Experience": "Experiência",
    "Contact": "Contato"
  },

  "home": {
    "Hi, I'm Luiz:": "Oi! Eu sou o Luiz:",
    "Front": "Desenvolvedor",
    "UX": "UX/UI Designer",
    "Designer": "Designer Gráfico",
    "Editor": "Editor de Vídeo",
    "catch_phrase": "Independentemente da função, meu trabalho é dar vida às ideias, criando experiências autênticas e memoráveis.",
    "About me": "Sobre mim",
    "Get in touch": "Entre em contato"
  },

  "skills": {
    "Skills": "Habilidades",

    "Development": "Programação",
    "DevelopText": "Já desenvolvi diversos projetos utilizando tecnologias como Typescript e Node.js, mas sempre exploro novas opções para elevar meu trabalho a patamares mais elevados. Também já trabalhei em projetos acadêmicos/pessoais envolvendo programação embarcada e processamento de imagens.",

    "UX/UI Design": "UX/UI Design",
    "UXDesignText": "Utilizo o Figma para projetar interfaces intuitivas e planejo Design Systems que representam o propósito do projeto. Além disso, sempre priorizo as necessidades do usuário ao passo em que busco uma experiência fluída e sem falhas.",

    "Design": "Design Gráfico",
    "DesignText": "Minha experiência em design gráfico gira em torno da criação de identidades visuais e materiais de marketing memoráveis. Dominando as principais ferramentas da Adobe Creative Cloud, minha dedicação transcende a estética: é sobre transmitir uma mensagem de maneira efetiva.",

    "Video Editing": "Edição de Vídeo",
    "VideoEditText": "Como editor de vídeo e Motion Designer, meu trabalho envolve criar narrativas para transformar conceitos em histórias que prendem. Em cada projeto, busco tanto a excelência visual quanto emocional."
  },

  "about": {
    "About me": "Sobre mim",
    "AboutText": "Sou o Luiz, desenvolvedor Web Front-End e estudante de Engenharia da Computação na Universidade Tecnológica Federal do Paraná. Apaixonado por design e tecnologia, dedico um tempo significativo para aprofundar e expandir meus conhecimentos nessas áreas. Descobri minha veia criativa desde cedo, quando comecei a atuar com design gráfico, edição e motion como freelancer. Desde então, vivo em constante processo de aperfeiçoamento para me tornar um profissional mais versátil.",

    "Tools and Technologies": "Ferramentas e Tecnologias",
    "ToolsText": "Gosto de explorar novas ferramentas e estou sempre em busca de me especializar em algo novo. Abaixo, você pode conferir algumas das tecnologias que já utilizei em projetos pessoais e profissionais.",
    "img_hover": "Esse sou eu!"
  },

  "projects": {
    "Projects": "Projetos",
    "ProjectsText": "Confira alguns projetos que já trabalhei."
  },

  "experience": {
    "Experience": "Experiência",
    "ExperienceText": "Role para ver experiências anteriores."
  },

  "contact": {
    "Contact": "Me envie uma mensagem!",
    "ContactText": "Possui uma dúvida, proposta ou só quer deixar um comentário? Fique livre para entrar em contato!",

    "NameLabel": "Seu Nome",
    "NamePlaceholder": "Insira seu nome",

    "EmailLabel": "Endereço de Email",
    "EmailPlaceholder": "Insira seu endereço de email",

    "MessageLabel": "Sua Mensagem",
    "MessagePlaceholder": "O seu perfil me chamou a atenção e estou interessado em discutir uma possível oportunidade de colaboração. Você está disponível para uma breve conversa?",
    "error-message": "Este campo é necessário.",
    "error-message-email": "Insira um endereço de email válido.",
    "submit": "Enviar",
    "send-success-message": "Sua mensagem foi enviada.",
    "send-error-message": "Algo deu errado. Tente novamente."
  },

  "footer": {
    "social-media": "REDES SOCIAIS",
    "sections": "SEÇÕES",
    "contact-info": "CONTATO",
    "lang": "IDIOMA",
    "Home": "HOME",
    "About": "SOBRE",
    "Skills": "HABILIDADES",
    "Projects": "PROJETOS",
    "Experience": "EXPERIÊNCIA",
    "Contact": "CONTATO"
  }
}
